---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesFrontDirn2
source: html/9c917a5c-9c81-9903-24ac-c3642a32e300.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesFrontDirn2 Property

"Exterior Minor Number Of Lines"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemNumberOfLinesFrontDirn2 { get; }
```